Revit 2024 API
ElementCategoryFilter Members
The ElementCategoryFilter type exposes the following members.
Constructors
Name | Description
ElementCategoryFilter(BuiltInCategory)
 Constructs a new instance of a filter to match elements by category.
ElementCategoryFilter(ElementId)
 Constructs a new instance of a filter to match elements by category.
ElementCategoryFilter(BuiltInCategory, Boolean)
 Constructs a new instance of a filter to match elements by category, with the option to match all elements which are not of the given category.
ElementCategoryFilter(ElementId, Boolean)
 Constructs a new instance of a filter to match elements by category, with the option to match all elements which are of the given category.
Methods
Name | Description
Dispose |  (Inherited from ElementFilter.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
PassesFilter(Element)
 Applies the filter to a given element.
 (Inherited from ElementFilter.)
PassesFilter(Document, ElementId)
 Applies the filter to a given element.
 (Inherited from ElementFilter.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
CategoryId
 The category id.
Inverted
 True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted.
 (Inherited from ElementFilter.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from ElementFilter.)
See Also
ElementCategoryFilter Class
Autodesk.Revit.DB Namespace